## Production: network

**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`  

**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!
```terraform
Plan: 7 to add, 1 to change, 2 to destroy
```

<details>
<summary>Show Plan</summary>

```terraform
aws_vpc.main: Refreshing state... [id=vpc-086a4997479cf5b10]
aws_eip.lambda: Refreshing state... [id=eipalloc-0e14bda1148801041]
aws_internet_gateway.gw: Refreshing state... [id=igw-00e00ca5f9d0d9bb1]
aws_default_route_table.default: Refreshing state... [id=rtb-0808af644864c76fc]
aws_default_security_group.default: Refreshing state... [id=sg-05da359a059d41cdd]
aws_subnet.public: Refreshing state... [id=subnet-0f56eba7c1dbfdbe1]
aws_subnet.private: Refreshing state... [id=subnet-06fcfc328ffe9f5d0]
aws_default_network_acl.default: Refreshing state... [id=acl-0549ea64c0a5dd244]
aws_security_group.efs: Refreshing state... [id=sg-0601b86c6c8a63c5d]
aws_security_group.lambda: Refreshing state... [id=sg-0b77afa7e1b78c3c2]
aws_route_table.public: Refreshing state... [id=rtb-03b21c36e7aa3f06d]
aws_security_group_rule.inet_egress: Refreshing state... [id=sgrule-2790156866]
aws_security_group_rule.efs_egress: Refreshing state... [id=sgrule-3197137894]
aws_security_group_rule.efs_ingress: Refreshing state... [id=sgrule-3307242864]
aws_nat_gateway.nat_gateway: Refreshing state... [id=nat-0330af1b2a402ec33]
aws_network_acl.main: Refreshing state... [id=acl-03ffeb664fa756d29]
aws_vpc_endpoint.dynamodb: Refreshing state... [id=vpce-00dc3084b7f725d68]
aws_route_table_association.public: Refreshing state... [id=rtbassoc-0e9f78a27f7846671]
aws_vpc_endpoint.s3: Refreshing state... [id=vpce-06674ae7bb78e969f]
aws_route_table.private: Refreshing state... [id=rtb-00da3a96f8b34217a]
aws_route_table_association.a: Refreshing state... [id=rtbassoc-06527543e55cc4b21]
aws_security_group_rule.s3_private_link: Refreshing state... [id=sgrule-1374877533]
aws_security_group_rule.dynamodb_privatelink: Refreshing state... [id=sgrule-2378049180]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.vpc_metrics_flow_logs_write will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "vpc_metrics_flow_logs_write"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:DescribeLogGroups",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # aws_cloudwatch_log_group.vpc_metrics_flow_logs will be created
  + resource "aws_cloudwatch_log_group" "vpc_metrics_flow_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "vpc_metrics_flow_logs"
      + retention_in_days = 30
      + tags_all          = (known after apply)
    }

  # aws_flow_log.vpc_metrics_flow_logs will be created
  + resource "aws_flow_log" "vpc_metrics_flow_logs" {
      + arn                      = (known after apply)
      + iam_role_arn             = (known after apply)
      + id                       = (known after apply)
      + log_destination          = (known after apply)
      + log_destination_type     = "cloud-watch-logs"
      + log_format               = (known after apply)
      + log_group_name           = (known after apply)
      + max_aggregation_interval = 600
      + tags_all                 = (known after apply)
      + traffic_type             = "ALL"
      + vpc_id                   = "vpc-086a4997479cf5b10"
    }

  # aws_iam_policy.vpc_metrics_flow_logs_write will be created
  + resource "aws_iam_policy" "vpc_metrics_flow_logs_write" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "CovidAlertMetricsVpcFlowLogs"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_role.vpc_metrics_flow_logs will be created
  + resource "aws_iam_role" "vpc_metrics_flow_logs" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "vpc-flow-logs.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "vpc_metrics_flow_logs"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.vpc_metrics_flow_logs_write will be created
  + resource "aws_iam_role_policy_attachment" "vpc_metrics_flow_logs_write" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "vpc_metrics_flow_logs"
    }

  # aws_network_acl.main will be updated in-place
  ~ resource "aws_network_acl" "main" {
        id         = "acl-03ffeb664fa756d29"
      ~ subnet_ids = [
          - "subnet-06fcfc328ffe9f5d0",
          - "subnet-0f56eba7c1dbfdbe1",
        ] -> (known after apply)
        tags       = {
            "Name" = "metricsstaging_main_nacl"
        }
        # (6 unchanged attributes hidden)
    }

  # aws_route_table_association.a must be replaced
-/+ resource "aws_route_table_association" "a" {
      ~ id             = "rtbassoc-06527543e55cc4b21" -> (known after apply)
      ~ subnet_id      = "subnet-06fcfc328ffe9f5d0" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_subnet.private must be replaced
-/+ resource "aws_subnet" "private" {
      ~ arn                             = "arn:aws:ec2:ca-central-1:820252213580:subnet/subnet-06fcfc328ffe9f5d0" -> (known after apply)
      ~ availability_zone               = "ca-central-1b" -> "ca-central-1a" # forces replacement
      ~ availability_zone_id            = "cac1-az2" -> (known after apply)
      ~ id                              = "subnet-06fcfc328ffe9f5d0" -> (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      - map_customer_owned_ip_on_launch = false -> null
      ~ owner_id                        = "820252213580" -> (known after apply)
        tags                            = {
            "Name" = "metricsstaging_private_subnet"
        }
        # (5 unchanged attributes hidden)
    }

Plan: 7 to add, 1 to change, 2 to destroy.

Changes to Outputs:
  ~ private_subnet_id = "subnet-06fcfc328ffe9f5d0" -> (known after apply)

------------------------------------------------------------------------

This plan was saved to: /home/runner/work/covid-alert-metrics-terraform/covid-alert-metrics-terraform/tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/covid-alert-metrics-terraform/covid-alert-metrics-terraform/tfplan.binary"

Releasing state lock. This may take a few moments...
```
</details>